Terraform plan in __terraform__
<details>
  <summary>Plan: 1 to add, 6 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repo["aws-admin"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "aws-admin/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["ghad"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "ghad/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["glossary"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "glossary"
      + sha                 = (known after apply)
    }

  # module.repo["newrelic-terraform"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "newrelic-terraform/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["pages-redirects"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "pages-redirects/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["private-eye"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "private-eye/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["uswds-jekyll"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "uswds-jekyll/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```
</details>

Plan generated in [plan #144](https://github.com/18F/tts-tech-portfolio/actions/runs/1128631522)